app/controllers/student_controller.rb

  def reports
    @batch = @student.batch
    @grouped_exams = GroupedExam.find_all_by_batch_id(@batch.id)
    @normal_subjects = Subject.find_all_by_batch_id(@batch.id,:conditions=>"no_exams = false AND elective_group_id IS NULL AND is_deleted = false")
    @student_electives = StudentsSubject.find_all_by_student_id(@student.id,:conditions=>{:batch_id=>@batch.id})
    @elective_subjects = []
    @student_electives.each do |e|
---
SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` = 5)
SELECT * FROM `subjects` WHERE (no_exams = false AND elective_group_id IS NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 5)
SELECT * FROM `students_subjects` WHERE (`students_subjects`.`batch_id` = 5) AND (`students_subjects`.`student_id` = 1)
SELECT * FROM `students` WHERE (`students`.user_id = 2) ORDER BY first_name LIMIT 1

  def list_students_by_course
    @students = Student.find_all_by_batch_id(params[:batch_id], :order => 'first_name ASC')
---
SELECT * FROM `students` WHERE (`students`.`batch_id` = '5') ORDER BY first_name ASC, first_name

  def profile
    @current_user = current_user
    @address = @student.address_line1.to_s + ' ' + @student.address_line2.to_s
    @additional_fields = StudentAdditionalField.all(:conditions=>"status = true")
    @sms_module = Configuration.available_modules
    @sms_setting = SmsSetting.new
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @immediate_contact = Guardian.find(@student.immediate_contact_id) \
      unless @student.immediate_contact_id.nil? or @student.immediate_contact_id == ''
---
SELECT * FROM `student_additional_fields` WHERE (status = true)
SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 1) LIMIT 1
SELECT * FROM `guardians` WHERE (`guardians`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.user_id = 2) ORDER BY first_name LIMIT 1

  def find_student
    @student = Student.find params[:id]
---
SELECT * FROM `students` WHERE (`students`.`id` = 4) ORDER BY first_name